// string :
length //해당 문자열의 길이를 반환한다.
indexOf //문자열에서 지정된 문자열 또는 문자의 첫 번째 발생 위치를 반환한다.
includes //  문자열이 특정 문자열을 포함하고 있는지 확인한다.
split // 문자열을 구분자를 기준으로 나누어 배열로 반환
substring // 문자열에서 시작 위치와 종료 위치를 지정하여 해당 부분 문자열을 반환한다.
substr //  문자열에서 시작 위치와 길이를 지정하여 해당 부분 문자열을 반환한다.
trim // 문자열의 양 끝에 있는 공백을 제거한다
toLowerCase // 문자열을 소문자로 변환한다.
toUpperCase // 문자열을 대문자로 변환한다.
replace // 문자열에서 특정 문자열을 찾아 다른 문자열로 대체한다.

// number : 
Number // 문자열이나 불리언 값을 숫자 타입으로 변환한다
parseInt // 문자열을 정수 타입으로 변환한다

// math : 
max // 인자로 받은 숫자 중 가장 큰 값을 반환한다
min // 인자로 받은 숫자 중 가장 작은 값을 반환한다
floor // 인자로 받은 숫자의 소수점 이하를 버린 정수 값을 반환한다
round // 인자로 받은 숫자를 반올림한 정수 값을 반환한다
random // 0과 1 사이의 난수를 반환한다
sqrt // 인자로 받은 숫자의 제곱근을 반환한다
